{"class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 60, 60, 3], "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_dtype": "float32", "batch_input_shape": [null, 60, 60, 3], "name": "lambda_1", "trainable": true, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>W\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "name": "lambda_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["lambda_1", 0, 0]]], "config": {"bias": true, "nb_row": 1, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 3, "nb_col": 1, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_1"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "name": "elu_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_1", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_2"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "name": "elu_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_2", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_3"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "name": "elu_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_3", 0, 0]]], "config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "maxpooling2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_4"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "name": "elu_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_4", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_5"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "name": "elu_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_5", 0, 0]]], "config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "maxpooling2d_2"}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "activation": "linear", "name": "convolution2d_6", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_6"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "name": "elu_6"}, {"class_name": "Convolution2D", "inbound_nodes": [[["elu_6", 0, 0]]], "config": {"bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "activation": "linear", "name": "convolution2d_7", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "name": "convolution2d_7"}, {"class_name": "ELU", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "name": "elu_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_7", 0, 0]]], "config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "maxpooling2d_3"}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"input_dim": 3136, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 512}, "name": "dense_1"}, {"class_name": "ELU", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "name": "elu_8"}, {"class_name": "Dense", "inbound_nodes": [[["elu_8", 0, 0]]], "config": {"input_dim": 512, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 128}, "name": "dense_2"}, {"class_name": "ELU", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "name": "elu_9"}, {"class_name": "Dense", "inbound_nodes": [[["elu_9", 0, 0]]], "config": {"input_dim": 128, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "bias": true, "output_dim": 1}, "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "keras_version": "1.2.0"}