{"config": {"layers": [{"config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 35, 140, 3]}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "batch_input_shape": [null, 35, 140, 3], "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "input_dtype": "float32", "arguments": {}}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_1", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_2", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_3", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_4", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_5", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 3, "activation": "relu", "name": "convolution2d_6", "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "nb_col": 3, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_3", "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "name": "dense_1", "init": "glorot_uniform", "output_dim": 512, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": 4352, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "name": "dense_2", "init": "glorot_uniform", "output_dim": 128, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": 512, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": 128, "activity_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3", "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.0", "class_name": "Model"}